wosayttn/lv_port_nuvoton/board/numaker-iiot-nuc980gxd/plat_driver/disp_glue.h
/**************************************************************************//**
 * @file     disp_glue.h
 * @brief    NuMaker Display Driver glue code for EBI 8080 interface LCD panel
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2026 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __DISP_GLUE_H__
#define __DISP_GLUE_H__

#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "nu_misc.h"

#if !defined(PORT_OFFSET)
    #define PORT_OFFSET                0x40
#endif

#if !defined(GPIO_PIN_DATA)
    #define GPIO_PIN_DATA              GPIO_PIN_DATA_S
#endif

#if !defined(CONFIG_DISP_USE_PDMA)
    #define CONFIG_DISP_USE_PDMA       1
#endif

#if defined(CONFIG_DISP_ILI9341) && (CONFIG_DISP_ILI9341==1)

/* ILI9341 SPI */
#define CONFIG_DISP_SPI              SPI0
#define CONFIG_DISP_SPI_CLOCK        48000000
#if defined(CONFIG_DISP_USE_PDMA)
    #define CONFIG_PDMA_SPI_TX       PDMA_SPI0_TX
    #define CONFIG_PDMA_SPI_RX       PDMA_SPI0_RX
    #define CONFIG_SPI_USE_PDMA
#endif

#define CONFIG_DISP_PIN_DC           NU_GET_PININDEX(evGF, 9)   //89    //PF9
#define CONFIG_DISP_PIN_RESET        NU_GET_PININDEX(evGF, 10)  //90    //PF10
#define CONFIG_DISP_PIN_BACKLIGHT    NU_GET_PININDEX(evGG, 7)   //103   //PG7
#define DISP_SET_RS                  GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_DC),        NU_GET_PIN(CONFIG_DISP_PIN_DC)) = 1
#define DISP_CLR_RS                  GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_DC),        NU_GET_PIN(CONFIG_DISP_PIN_DC)) = 0

#else

#endif

#define CONFIG_VRAM_BUFFER_NUM              1
#define CONFIG_DISP_LINE_BUFFER_NUMBER      (DISP_VER_RES_MAX)
#define CONFIG_VRAM_TOTAL_ALLOCATED_SIZE    NVT_ALIGN((DISP_HOR_RES_MAX * CONFIG_DISP_LINE_BUFFER_NUMBER * (DISP_COLOR_DEPTH/8)), 32)

#define DISP_SET_RST               GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_RESET),     NU_GET_PIN(CONFIG_DISP_PIN_RESET)) = 1
#define DISP_CLR_RST               GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_RESET),     NU_GET_PIN(CONFIG_DISP_PIN_RESET)) = 0
#define DISP_SET_BACKLIGHT         GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_BACKLIGHT), NU_GET_PIN(CONFIG_DISP_PIN_BACKLIGHT)) = 1
#define DISP_CLR_BACKLIGHT         GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_BACKLIGHT), NU_GET_PIN(CONFIG_DISP_PIN_BACKLIGHT)) = 0



void sysDelay(uint32_t ms);

#endif /* __DISP_GLUE_H__ */
